export class ItemPackageDat {
    static List = [
        {
            name: "サマーパッケージ2026",
            itemIds: [
                5695, // トゥーサイドウィング
                5697, // プライモーディアルウェポンズ
                5698, // セレスティアルマグナニミティ
                5700, // マグヌス・ドミヌス
                5702, // ヴェスティギアサーベラス
            ],
        },
        {
            name: "サマーパッケージ2025",
            itemIds: [
                5479, // ズホー
                5481, // アルヴァ
                5490, // グラットン
                5488, // マギア
                5483, // セイバーガ
            ],
        },
        {
            name: "サマーパッケージ2024",
            itemIds: [
                5217, // オブアビ
                5213, // ルリフ
                5215, // マナフ
                5222, // デイブレ
                5220, // カラミ
            ],
        },
        {
            name: "23rdアニバーサリーパッケージ",
            itemIds: [
                5569, // アルカナム
                5565, // ソリッドステート
                5567, // アーリースカイ
                5563, // セレスティアルインテ
                5571, // グローバルラ
            ],
        },
        {
            name: "22rdアニバーサリーパッケージ",
            itemIds: [
                5368, // アトクウェ
                5375, // ホロウア
                5372, // グラーテ
                5367, // パーマフ
                5370, // 心外
            ],
        },
        {
            name: "21rdアニバーサリーパッケージ",
            itemIds: [
                4994, // アウェイ
                4995, // サイドダ
                4997, // イビルアイ
                4999, // コズミ
                5001, // ストパ
            ],
        },
        {
            name: "ラグ缶2026 July",
            itemIds: [
                5760, // キングオブウェアウルフ
                5761, // スターシアター
                5762, // イクトゥスのロザリオ(銀)
            ],
        },
        {
            name: "ラグ缶2026 June",
            itemIds: [
                5691, // スタリー
                5692, // リングア
                5693, // メアチ
            ],
        },
        {
            name: "ラグ缶2026 April",
            itemIds: [
                5667, // ジュディス
                5668, // リーブラ
                5669, // ルインテ
            ],
        },
        {
            name: "ラグ缶2026 Spring",
            itemIds: [
                5689, // ス・ロザリオ
                5690, // グロリオ
                5688, // ニトゥス
                5687, // 覚醒創星
            ],
        },
        {
            name: "ラグ缶2026 September",
            itemIds: [
                5785, // マジカルケープ
                5786, // 藤の扇
                5783, // ハルピュイア
                5784, // グリンカムビ
            ],
        },
        {
            name: "ラグ缶2026 Summer",
            itemIds: [
                5779, // フューリアスオーブ
                5778, // ドーントレス
                5776, // ポポリンサンバイザー
                5777, // パルスオブイグドラシル
            ],
        },
        {
            name: "ラグ缶2026 October",
            itemIds: [
                5789, // アバドン
                5790, // くわえたクラブのエース
                5791, // クラナネミエリーの傍観者
                5792, // ディメンションクリミナルアーク
            ],
        },
    ];
}

