(function () {

	COSTUME_ID_HEAD_UNDER_NONE = 0;
	COSTUME_ID_BEGINNER_BO = 1;

	CostumeOBJ = [
		[0,4,0,0,0,0,0,1,"(衣装なし)","ア","",0],
		[1,4,96,0,0,0,0,1,"[衣装]ビギナー帽","ヒキナアホウ","[初心者用ポーション]使用時、HP回復量 + 50%<BR>[応急手当]使用時、冒険者アカデミーに移動することができる<BR>BaseLvが10上がる度に追加でヒール系スキルを受けた時のHP回復量 + 10%、一部の回復アイテムによるHP回復量 + 10%<BR>Hit -3 , 詠唱時間 + 1%<BR>MaxHP - 100 , MaxSP - 20<BR>ヒール系スキル使用時、HP回復量 - 10%<BR>BaseLv99以上の時、上記特殊効果が発動しない<BR>[[衣装]ビギナー帽]の効果は、攻城戦・新攻城戦・攻城戦TEの砦内では発揮されず、解除されます。",8,30,13,1000,14,200,73,-10,91,150,0],
	];

})();
