export class ItemPackageDat {
    static List = [
        {
            id: 1,
            name: "サマーパッケージ2026",
            itemIds: [
                5695, // トゥーサイドウィング
                5697, // プライモーディアルウェポンズ
                5698, // セレスティアルマグナニミティ
                5700, // マグヌス・ドミヌス
                5702, // ヴェスティギアサーベラス
            ],
        },
        {
            id: 2,
            name: "サマーパッケージ2025",
            itemIds: [
                5479, // ズホー
                5481, // アルヴァ
                5490, // グラットン
                5488, // マギア
                5483, // セイバーガ
            ],
        },
        {
            id: 3,
            name: "サマーパッケージ2024",
            itemIds: [
                5217, // オブアビ
                5213, // ルリフ
                5215, // マナフ
                5222, // デイブレ
                5220, // カラミ
            ],
        },
        {
            id: 4,
            name: "23rdアニバーサリーパッケージ",
            itemIds: [
                5569, // アルカナム
                5565, // ソリッドステート
                5567, // アーリースカイ
                5563, // セレスティアルインテ
                5571, // グローバルラ
            ],
        },
        {
            id: 5,
            name: "22rdアニバーサリーパッケージ",
            itemIds: [
                5368, // アトクウェ
                5375, // ホロウア
                5372, // グラーテ
                5367, // パーマフ
                5370, // 心外
            ],
        },
        {
            id: 6,
            name: "21rdアニバーサリーパッケージ",
            itemIds: [
                4994, // アウェイ
                4995, // サイドダ
                4997, // イビルアイ
                4999, // コズミ
                5001, // ストパ
            ],
        },
        {
            id: 7,
            name: "ラグ缶2026 June",
            itemIds: [
                5691, // スタリー
                5692, // リングア
                5693, // メアチ
            ],
        },
        {
            id: 8,
            name: "ラグ缶2026 April",
            itemIds: [
                5667, // ジュディス
                5668, // リーブラ
                5669, // ルインテ
            ],
        },
        {
            id: 9,
            name: "ラグ缶2026 Spring",
            itemIds: [
                5689, // ス・ロザリオ
                5690, // グロリオ
                5688, // ニトゥス
                5687, // 覚醒創星
            ],
        }
    ];
}

