(function () {

	PET_ID_NONE = 0;
	PET_ID_ALICE = 1;
	PET_ID_ISIS = 2;
	PET_ID_INCUBUS = 3;
	PET_ID_IMP = 4;
	PET_ID_WHISPER = 5;
	PET_ID_ORC_WARRIOR = 6;
	PET_ID_KABUKI_NINJA = 7;
	PET_ID_CHIRISTMAS_GOBLIN = 8;
	PET_ID_GOLEM = 9;
	PET_ID_KO_DESSERT_WOLF = 10;
	PET_ID_GOBLIN_LEADER = 11;
	PET_ID_SUCUBUS = 12;
	PET_ID_SAVAGE_BEBE = 13;
	PET_ID_JIRTUS = 14;
	PET_ID_STEAL_CHONGCHONG = 15;
	PET_ID_SPORE = 16;
	PET_ID_SMOKY = 17;
	PET_ID_SOPHIE = 18;
	PET_ID_CHUNG_EAH = 19;
	PET_ID_CHONGCHONG = 20;
	PET_ID_DEVILCH = 21;
	PET_ID_DULAHAN = 22;
	PET_ID_TENSEN_NYANGNYANG = 23;
	PET_ID_DOKEBI = 24;
	PET_ID_DROPPS = 25;
	PET_ID_NIGHTMARE_TERROR = 26;
	PET_ID_BAPHOMET_JR = 27;
	PET_ID_HUNTERFLY = 28;
	PET_ID_PIKKI = 29;
	PET_ID_GROUND_PETIT = 30;
	PET_ID_FLAME_SHOOTER = 31;
	PET_ID_PEKOPEKO = 32;
	PET_ID_POISON_SPORE = 33;
	PET_ID_POPORING = 34;
	PET_ID_PORING = 35;
	PET_ID_BONGGONG = 36;
	PET_ID_MARIONET = 37;
	PET_ID_MIYABI_NINGYO = 38;
	PET_ID_MYOGUE = 39;
	PET_ID_MUNAC = 40;
	PET_ID_MEDUSA = 41;
	PET_ID_MOCHIRING = 42;
	PET_ID_YOYO = 43;
	PET_ID_LEAFCAT = 44;
	PET_ID_RUNATIC = 45;
	PET_ID_ROCKER = 46;
	PET_ID_LOLIRURI = 47;
	PET_ID_DOMOVOY = 48;
	PET_ID_SAMAYOUMONO = 49;
	PET_ID_TIKBARAN = 50;
	PET_ID_RUBYRIT = 51;
	PET_ID_SAPPHARIT = 52;
	PET_ID_EMERIT = 53;
	PET_ID_TOPARIT = 54;
	PET_ID_AMERIT = 55;
	PET_ID_MYTHRIT = 56;
	PET_ID_TAMADORA = 57;
	PET_ID_SWEET_DROPPS = 58;
	PET_ID_HIORC = 59;
	PET_ID_ORC_HERO = 60;
	PET_ID_METARURA = 61;
	PET_ID_MASTERING = 62;
	PET_ID_ANGELING = 63;
	PET_ID_PEKUSOZIN = 64;
	PET_ID_CAT_NINE_TAIL = 65;
	PET_ID_UORYAFA = 66;
	PET_ID_NIFL_LEON = 67;
	PET_ID_SUTERARETA_KUMA_NINGYO = 68;
	PET_ID_CHIBI_KANRISHA_BETA = 69;
	PET_ID_CHIBI_KANRISHA_ALPHA = 70;
	PET_ID_WILD_ROSE = 71;
	PET_ID_OSENSARETA_SAMAYOUMONO = 72;
	PET_ID_ELLIOT = 73;
	PET_ID_CHIEL_D01 = 74;
	PET_ID_ELLISEL = 75;
	PET_ID_ELLISA = 76;
	PET_ID_EDOGA = 77;
	PET_ID_FURIONI = 78;
	PET_ID_GLEMRIN = 79;
	PET_ID_HODOREMLIN = 80;
	PET_ID_GROOM_UNDERNIGHT = 81;
	PET_ID_GROUND_DELETER = 82;
	PET_ID_GOBLIN_CHONAN = 83;
	PET_ID_MOMMY = 84;
	PET_ID_ANCIENT_MOMMY = 85;
	PET_ID_SHINENNO_KISHI = 86;
	PET_ID_DARK_PRIEST = 87;
	PET_ID_DARK_ILLUSION = 88;
	PET_ID_DARK_LORD = 89;
	PET_ID_KOKA_NIGHTMARE_TERROR = 90;

	PET_OBJ = [
		[0,"キューペットなし","ア","",0],
		[1,"アリス","アリス","",0],
		[2,"（×）イシス","イシス","<red>※実際のゲーム内では、特殊効果は存在しない可能性あり。</red>",5000000000000080,1,5000000000000089,-1,0],
		[3,"（△）インキュバス","インキユハス","<red>※特殊効果は恐らく存在するが、アイテム説明に記載なし。</red>",5000000000000016,5,0],
		[4,"インプ","インフ","",5000000000000043,1,5000000000000063,2,0],
		[5,"（△）ウィスパー","ウイスハア","<red>※特殊効果は恐らく存在するが、アイテム説明に記載なし。</red>",5000000000000009,7,5000000000000018,-3,0],
		[6,"（×）オークウォリアー","オオクウオリアア","<red>※実際のゲーム内では、特殊効果は存在しない可能性あり。</red>",5000000000000017,10,5000000000000018,-3,0],
		[7,"（△）カブキ忍者","カフキニンシヤ","<red>※特殊効果は恐らく存在するが、アイテム説明に記載なし。</red>",5000000000000002,2,0],
		[8,"（×）クリスマスゴブリン","クリスマスコフリン","<red>※実際のゲーム内では、特殊効果は存在しない可能性あり。</red>",5000000000000013,30,5000000000000152,5,0],
		[9,"（△）ゴーレム","コオレム","<red>※特殊効果は恐らく存在するが、アイテム説明に記載なし。</red>",5000000000000013,100,5000000000000009,-5,0],
		[10,"子デザートウルフ","コテサアトウルフ","",0],
		[11,"（△）ゴブリンリーダー","コフリンリイタア","<red>※特殊効果は恐らく存在するが、アイテム説明に記載なし。</red>",5000000000000037,3,0],
		[12,"（×）サキュバス","サキユハス","親密度が「親しい」以上の場合、追加で一定確率[2%]で与ダメージの5%をHPとして吸収<br><red>※実際のゲーム内では、ペット単体で発揮される特殊効果は存在しない可能性あり。</red><br><red>　（セット効果は存在する）</red>",0],
		[13,"サベージベベ","サヘエシヘヘ","",0],
		[14,"（×）ジルタス","シルタス","<red>※実際のゲーム内では、ペット単体で発揮される特殊効果は存在しない可能性あり。</red><br><red>　（セット効果は存在する）</red>",5000000000000037,2,5000000000000177,2,0],
		[15,"（×）スチールチョンチョン","スチイルチヨンチヨン","<red>※実際のゲーム内では、特殊効果は存在しない可能性あり。</red>",5000000000000009,6,5000000000000002,-1,0],
		[16,"（×）スポア","スホア","<red>※実際のゲーム内では、特殊効果は存在しない可能性あり。</red>",5000000000000008,5,5000000000000017,-2,0],
		[17,"（×）スモーキー","スモオキイ","<red>※実際のゲーム内では、特殊効果は存在しない可能性あり。</red>",5000000000000002,1,5000000000000011,1,0],
		[18,"（×）ソヒー","ソヒイ","<red>※実際のゲーム内では、特殊効果は存在しない可能性あり。</red>",5000000000000001,1,5000000000000005,1,0],
		[19,"チュン・イー","チユンイイ","",5000000000000018,1,5000000000000057,1,0],
		[20,"（×）チョンチョン","チヨンチヨン","<red>※実際のゲーム内では、特殊効果は存在しない可能性あり。</red>",5000000000000002,1,5000000000000009,2,0],
		[21,"デビルチ","テヒルチ","",0],
		[22,"（△）デュラハン","テユラハン","<red>※特殊効果は恐らく存在するが、アイテム説明に記載なし。</red>",5000000000000070,5,0],
		[23,"天仙娘々","テンセンニヤンニヤン","",5000000000000014,30,5000000000000076,5,0],
		[24,"（×）ドケビ","トケヒ","<red>※実際のゲーム内では、特殊効果は存在しない可能性あり。</red>",5000000000000089,1,5000000000000080,-1,0],
		[25,"（×）ドロップス","トロツフス","<red>※実際のゲーム内では、特殊効果は存在しない可能性あり。</red>",5000000000000008,3,5000000000000017,3,0],
		[26,"（△）ナイトメアテラー","ナイトメアテラア","<red>※特殊効果は恐らく存在するが、アイテム説明に記載なし。</red>",5000000000000155,100,0],
		[27,"バフォメット.Jr","ハフオメツトシユニア","",0],
		[28,"（×）ハンターフライ","ハンタアフライ","<red>※実際のゲーム内では、特殊効果は存在しない可能性あり。</red>",5000000000000011,2,5000000000000009,-5,0],
		[29,"（×）ピッキ","ヒツキ","<red>※実際のゲーム内では、特殊効果は存在しない可能性あり。</red>",5000000000000001,1,5000000000000017,5,0],
		[30,"グラウンドプティット","クラウントフテイツト","",0],
		[31,"（△）フレイムシューター","フレイムシユウタア","<red>※特殊効果は恐らく存在するが、アイテム説明に記載なし。</red>",5000000000000063,3,0],
		[32,"（×）ペコペコ","ヘコヘコ","<red>※実際のゲーム内では、特殊効果は存在しない可能性あり。</red>",5000000000000013,150,5000000000000014,-10,0],
		[33,"（×）ポイズンスポア","ホイスンスホア","<red>※実際のゲーム内では、特殊効果は存在しない可能性あり。</red>",5000000000000001,1,5000000000000004,1,0],
		[34,"（×）ポポリン","ホホリン","<red>※実際のゲーム内では、特殊効果は存在しない可能性あり。</red>",5000000000000006,2,5000000000000150,10,0],
		[35,"（×）ポリン","ホリン","<red>※実際のゲーム内では、特殊効果は存在しない可能性あり。</red>",5000000000000006,2,5000000000000010,1,0],
		[36,"（×）ボンゴン","ホンコン","<red>※実際のゲーム内では、特殊効果は存在しない可能性あり。</red>",5000000000000003,1,5000000000000151,1,0],
		[37,"（△）マリオネット","マリオネツト","<red>※特殊効果は恐らく存在するが、アイテム説明に記載なし。</red>",5000000000000076,3,0],
		[38,"雅人形","ミヤヒニンキヨウ","",5000000000000004,1,5000000000000073,-3,0],
		[39,"（△）ミョグェ","ミヨクエ","<red>※特殊効果は恐らく存在するが、アイテム説明に記載なし。</red>",5000000000000014,10,0],
		[40,"（×）ムナック","ムナツク","<red>※実際のゲーム内では、特殊効果は存在しない可能性あり。</red>",5000000000000004,1,5000000000000018,1,0],
		[41,"（△）メデューサ","メテユウサ","<red>※特殊効果は恐らく存在するが、アイテム説明に記載なし。</red>",5000000000000003,1,5000000000000159,5,0],
		[42,"（×）モチリン","モチリン","<red>※実際のゲーム内では、ペット単体で発揮される特殊効果は存在しない可能性あり。</red><br><red>　（セット効果は存在する）</red>",5000000000000050,1,5000000000000015,-1,0],
		[43,"（×）ヨーヨー","ヨオヨオ","<red>※実際のゲーム内では、特殊効果は存在しない可能性あり。</red>",5000000000000010,3,5000000000000006,-1,0],
		[44,"（△）リーフキャット","リイフキヤツト","<red>※特殊効果は恐らく存在するが、アイテム説明に記載なし。</red>",5000000000000052,3,0],
		[45,"（×）ルナティック","ルナテイツク","<red>※実際のゲーム内では、特殊効果は存在しない可能性あり。</red>",5000000000000010,2,5000000000000017,2,0],
		[46,"（×）ロッカー","ロツカア","<red>※実際のゲーム内では、特殊効果は存在しない可能性あり。</red>",5000000000000075,5,5000000000000013,25,0],
		[47,"（△）ロリルリ","ロリルリ","<red>※特殊効果は恐らく存在するが、アイテム説明に記載なし。</red>",5000000000000015,3,5000000000000221,102,0],
		[48,"ドモヴォイ","トモウオイ","",5000000000000037,1,5000000000000177,1,5000000000000057,1,0],
		[49,"彷徨う者","サマヨウモノ","",5000000000000012,1,6000000000000012,1,0],
		[50,"ティクバラン","テイクハラン","",19,3,1640,10,1644,10,1636,10,1639,10,0],
		[51,"ルビリット","ルヒリツト","",5000000000000017,10,6000000000000017,10,0],
		[52,"サファリット","サフアリツト","",5000000000000013,100,6000000000000013,100,0],
		[53,"エメリット","エメリツト","",5000000000000013,50,5000000000000014,25,6000000000000013,50,6000000000000014,25,0],
		[54,"トパリット","トハリツト","",5000000000000014,50,6000000000000014,50,0],
		[55,"アメリット","アメリツト","",5000000000000100,10,6000000000000100,10,0],
		[56,"ミスリット","ミスリツト","",5000000000000217,1,6000000000000217,1,0],
		[57,"たまドラ","タマトラ","",5000000000000221,13,6000000000000220,5,0],
		[58,"スウィートドロップス","スウイイトトロツフス","",2000000000000015,10,2000000000000075,100,0],
		[59,"ハイオーク","ハイオオク","",2000000000000032,5,2000000000000172,5,0],
		[60,"オークヒーロー","オオクヒイロオ","",2000000000000071,10,2000000000000220,21,0],
		[61,"メタルラ","メタルラ","",2000000000005641,20,0],
		[62,"マスターリング","マスタアリンク","",2000000000000033,5,2000000000000173,5,0],
		[63,"エンジェリング","エンシエリンク","",2000000000000047,10,2000000000000049,10,2000000000000357,10,2000000000000359,10,0],
		[64,"ペクソジン","ヘクソシン","",2000000000000298,50,2000000000000220,105,0],
		[65,"キャットナインテイル","キヤツトナインテイル","",2000000000000036,5,2000000000000176,5,0],
		[66,"月夜花","ウオルヤフア","BaseLv100以上の時、物理攻撃命中時、一定確率で敵に与えたダメージの3%をSPとして吸収",2000000000000220,16,0],
		[67,"ニブルレオン","ニフルレオン","BaseLv100以上の時、物理攻撃でモンスターを倒した時、HP + 100 , SP + 10",0],
		[68,"捨てられたクマ人形","ステラレタクマニンキヨウ","",2000000000000347,10,0],
		[69,"ちび管理者ベータ","チヒカンリシヤヘエタ","",0],
		[70,"ちび管理者アルファ","チヒカンリシヤアルフア","",5830,20,0],
		[71,"ワイルドローズ","ワイルトロオス","",0],
		[72,"汚染された彷徨う者","オセンサレタサマヨウモノ","BaseLv100以上の時、[クリティカルスラッシュ]で受けるダメージ - 50%",0],
		[73,"エリオット","エリオツト","",2000000000000030,5,2000000000000170,5,0],
		[74,"キエル-D-01","キエルテイ０１","BaseLv100以上の時、絶対にノックバックしない",2000000000000220,159,0],
		[75,"エリセル","エリセル","",2000000000000070,10,0],
		[76,"エリザ","エリサ","",2000000000000037,5,2000000000000177,5,0],
		[77,"エドガ","エトカ","",2000000000000220,160,2000000000000228,1,0],
		[78,"フリオニ","フリオニ","",2000000000000220,65,2000000700000013,50,2000000700000018,3,0],
		[79,"グレムリン","クレムリン","",0],
		[80,"ホドレムリン","ホトレムリン","",2000000000005328,20,0],
		[81,"グルームアンダーナイト","クルウムアンタアナイト","BaseLv100以上の時、一部のダメージを反射する効果で受けるダメージ - 10%(計算機未対応)",2000000000000220,61,0],
		[82,"グラウンドデリーター","クラウントテリイタア","",2000000000000039,5,2000000000000179,5,0],
		[83,"ゴブリン長男","コフリンチヨウナン","",0],
		[84,"マミー","マミイ","",0],
		[85,"エンシェントマミー","エンシエントマミイ","",2000000000000009,50,0],
		[86,"深淵の騎士","シンエンノキシ","",2000000000000220,150,2000000200000019,3,2000000200000086,2,0],
		[87,"ダークプリースト","タアクフリイスト","",0],
		[88,"ダークイリュージョン","タアクイリユウシヨン","",2000000000005125,20,0],
		[89,"ダークロード","タアクロオト","",2000000000000343,10,2000000000000340,10,2000000000000220,128,0],
		[90,"硬化ナイトメアテラー","コウカナイトメアテラア","",2000000000000010,20,0],
	];

})();
